Nonoum/LP_MPPT_PIC12F675/pic12f675/main.c
    Partial shading: use cases of this project don't assume optimal work with significant partial shading (no "full scan" is implemented, nor it's possible with such scheme).
    Personal notes:
        *- although I believe it will work pretty well with real-world partial shading cases;
        *- partial shading isn't a problem that needs solving (except for very specific forced cases) as solar panels as technology simply doesn't assume partial shading - so just do proper installation / consider proper sizes to avoid any partial shading;
*/

#define _XTAL_FREQ 4000000

#include <xc.h>

//BEGIN CONFIG
#pragma config FOSC = INTRCIO
#pragma config WDTE = OFF // Watchdog Timer Enable bit (WDT enabled)
#pragma config PWRTE = OFF // Power-up Timer Enable bit (PWRT disabled)
#pragma config MCLRE = OFF // MCLR internal, use pin as IO
#pragma config BOREN = ON // Brown-out Reset Enable bit (BOR enabled)
#pragma config CP = OFF // Flash Program Memory Code Protection bit (Code protection off)
#pragma config CPD = OFF // Data EEPROM Memory Code Protection bit (Data EEPROM code protection off)
//END CONFIG


/*
    PROJ_CONST_THR notes:
    - for now using a constant hard-hardcoded threshold value (with hardcoded ifdef-generated multiplication function);
    - planning to compile several versions with different offsets for the value to compensate input diode Vf;

    Input diode Vf (voltage drop on the input shottky diode):
    - due to scheme specifics measurings of voltage is done after diode(s)*
        *could be done before diode if only one solar panel is used (one parallel connection);
        *if several panels are connected in parallel - each 'positive' wire should be connected through an individual diode (or each negative, but not mixed);
    - when measuring raw (no load/OCV) voltage - the diode current is minimum, diode Vf is minimum and can be negligible;
    - when measuring voltage during load - Vf is larger and depends on current, specific diode, diode temperature,
        so to expect a correct(more or less) percentage of raw(no load/OCV) voltage on the panel(s) - some offset of diode Vf should be considered,
        so: several versions of FW with different hardcoded THR would be available to accomodate target case the best way;
    - current dependency: for big current Vf would be bigger and appropriate offset (for maximum expected current) should be used to maximize output power (+minimize current fluctuations);
    - other offset considerations: it's better to offset THR a little lower (linear loss comparing to MPP) than higher (rather exponencial loss according to solar panels U/I characteristics);
*/
#define PROJ_CONST_THR 198 // hard constant threshold percentage (x/255) of raw(no load/OCV) voltage to hold

// version info (3 numbers and letter) is accessible at top program-memory addresses right before OSCCAL (retlw commands)
#define FW_VER_MAJOR 0
#define FW_VER_MINOR 4
#define FW_VER_THR PROJ_CONST_THR
#define FW_VER_OPTION 'A' // some letter describing topology/configuration of compiled code. default is 'A'
/*
    FW_VER_OPTION vaiants:
    - 'A' (0x41) : unregulated output;
        single output-fet-driving pin is GPIO0;
        GPIO1 controls mosfet of buffer capacior;
        GPIO2 is ADC input;
        GPIO4 - input mode debug pin, GPIO5 - output mode debug pin.
*/





#define AUX_STRINGIFY_INTERNAL(foo) #foo
#define AUX_STRINGIFY(foo) AUX_STRINGIFY_INTERNAL(foo)

// manual params
#define PROJ_TMR_PRESCALE (0b111) // x256

// pins / topology
#define PROJ_BIT_NUM_OUT_OUT 0 // GPIO0 : N-channel mosfet (or 'enable' pin on output line) controlling output line, PULLDOWN external resistor
#define PROJ_BIT_NUM_OUT_CAP 1 // GPIO1 : N-channel mosfet controlling power capacitor, PULLUP external resistor 200k
#define PROJ_BIT_NUM_IN_BTN 4 // GPIO4 (PROJ_BIT_IN_BTN)
#define PROJ_BIT_NUM_OUT_DEBUG 5 // GPIO5
#define PROJ_ADC_CH_VOL 2 // ADC channel - AN2 (GPIO2) : voltage divider for power line - calculate so that it maxes out to chip PSU level (used 3.3 regulator)

// ADC allows up to 10k resistance, thus for 5vols it's NOT LESS than 0.5ma current for each ADC channel
#define PROJ_ADC_ADCS 0b010 // conversion time

#define PROJ_THR_DIFF_INSTANT_DROPOUT 6 // thr_hi - adcval >= 'this' ? full power drop
#define PROJ_PWR_LEVEL_MAX 26

#define PROJ_PWR_RISE_DELAY 3 // number of consequent times for ADC checks to trigger single rise in certain cases

GPIObits_t gp_shadow;

uint8_t app_flags;
#define APP_FLAG_LAST_BTN_ON 0
#define APP_FLAG_TMP_BTN_ON 1

uint8_t app_rise_counter;

#define PROJ_OUT_FET_PINS_MASK (1 << PROJ_BIT_NUM_OUT_OUT)
#define PROJ_OUT_FET_PINS_NEG_MASK (~PROJ_OUT_FET_PINS_MASK)

uint8_t dirty_flags;
#define APP_DIRTY_FLAG_TRAW 0 // bit numbers. if another 1000ms have passed and requires processing
#define APP_DIRTY_FLAG_TDEBUG 1 // debug time (not used if not debug build)
#define APP_DIRTY_FLAG_THRS 2 // if thresholds need recalculation
#define APP_DIRTY_FLAG_NOP1 3
#define APP_DIRTY_FLAG_NOP2 4

/*
    OSSCAL deviation: on my PIC it was x1.65 difference between min and max frequency (osccal 0x00-min freq and 0xFC-max freq)
    with typical calibrated values checked on 5 pics being around 0x24 - 0x44, so setting osccal to max value is assumed
    to multiply actual frequency by around x1.5 (comparing to 4mhz spec).
*/

// relies on active bank 0
#define PROJ_ASSIGN_OUT_1 \
    asm("movf _gp_shadow,w"); \
    asm("iorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_MASK)); \
    asm("movwf 5"); /* assign GPIO */ \
    asm("movwf _gp_shadow"); /* refresh gp_shadow */
#define PROJ_ASSIGN_OUT_0 \
    asm("movf _gp_shadow,w"); \
    asm("andlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_NEG_MASK)); \
    asm("movwf 5"); /* assign GPIO */ \
    asm("movwf _gp_shadow"); /* refresh gp_shadow */


// local isr vars
#define PROJ_ISR_CTR_INITER_T0 16
uint8_t isr_ctr_t0 = PROJ_ISR_CTR_INITER_T0;

// isr cache
uint8_t temp_w;
uint8_t temp_status;
//

asm("global _isr");
void isr(void) __at(0x0004)
{
    asm("movwf _temp_w");
    asm("swapf 3,w");
    asm("movwf _temp_status");
    //asm("bcf 3,5"); // select bank 0 - may be not necessary in isr
    // context saved

    PROJ_ASSIGN_OUT_0 // we actually should never get here as we catch upcoming timer interrupt and process manually
    // ++64ms
    asm("decfsz _isr_ctr_t0,f"); // --ctr, test
    asm("goto labe_isr_out");
        asm("bsf _dirty_flags," AUX_STRINGIFY(APP_DIRTY_FLAG_TRAW));
        asm("movlw " AUX_STRINGIFY(PROJ_ISR_CTR_INITER_T0));
        asm("movwf _isr_ctr_t0"); // reinit ctr
    asm("labe_isr_out:");
    asm("bcf 11,2"); // INTCONbits.T0IF = 0; // regardless of current bank

    // context restoring
    asm("swapf _temp_status,w");
    asm("movwf 3"); // recover status
    asm("swapf _temp_w,f");
    asm("swapf _temp_w,w"); // recover w
    //
    asm("retfie"); // compiler auto-generates "return" here, nevermind at the moment, just use explicit retfie.
}

